[
  "Formation: Deust\nNom du programme: BIOLOGIE, GEOLOGIE, CHIMIE\nID: BCG\n\nObjectifs du programme:\n- d'accéder:\n- Aux Semestres 5 et 6 des L icences en Sciences et Techniques (LST) relevant de la Biologie, de la Géologie et de la Chimie;\n- Aux concours de filières d’ingénieurs spécialisées dans le domaine des sciences de la vie, de la Terre, de l’environnement. ..\n- Aux Licences de l’enseignement dispensées par les Ecoles Normales Supérieures;\n- Au concours de Pharmacie. ..",
  "Les modules du semestre S1 de la formation DEUST (ID: BCG) sont: Biologie cellulaire (56h), Optique géométrique et instrumentale (56h), Radioactivité (56h), Cosmologie et Géodynamique interne (56h), Structure et Etats de la Matière (56h), Algèbre (56h), TEC 1 (56h), VH global du semestre 1 (336h)",
  "Les modules du semestre S2 de la formation DEUST (ID: BCG) sont: Biologie animale (56h), Thermodynamique, Mécanique des fluides (56h), Géodynamique externe (56h), Réactivité Chimique (56h), Bases de données (56h), TEC 2 (56h), VH global du semestre 2 (336h)",
  "Les modules du semestre S3 de la formation DEUST (ID: BCG) sont: Biologie végétale (56h), Electricité (56h), Stratigraphie, Paléontologie et Paléoécologie (56h), Chimie organique 1 (56h), Chimie minérale 1 (56h), Analyse (56h), VH global du semestre 3 (336h)",
  "Les modules du semestre S4 de la formation DEUST (ID: BCG) sont: Biochimie structurale (56h), Microbiologie générale (56h), Biochimie métabolique (56h), Tectonique (56h), Statistique descriptive et Probabilités (56h), TEC 3 (56h), VH global du semestre 4 (336h)",
  "Contact de la formation DEUST de BIOLOGIE, GEOLOGIE, CHIMIE (BCG): Département: Biologie, Chimie et Géologie, Responsable: M. Ali Bachnou, Email: a. bachnou@uca. ma",
  "Formation: Deust\nNom du programme: MATEMATIQUES, INFORMATIQUE, PHYSIQUE, CHIMIE\nID: MIPC\n\nObjectifs du programme:\n- Les étudiants poursuivront des modules de tronc commun dans les quatre disciplines: chimie, physique, mathématiques et informatique qui leur permettront d’acquérir des connaissances générales à propos des phénomènes physico-chimiques d’une part et des atouts de calculs mathématiques d’autre part.",
  "Les modules du semestre S1 de la formation DEUST (ID: MIPC) sont: Thermodynamique (56h), Mécanique du point et Optique géométrique (56h), Analyse 1: Fonction d’une variable réelle (56h), Algèbre 1: Polynômes et espaces vectoriels (56h), Algorithmique et Programmation 1 (56h), TEC 1 (56h), VH global du semestre 1 (336h)",
  "Les modules du semestre S2 de la formation DEUST (ID: MIPC) sont: Circuits électriques et électroniques (56h), Electricité (56h), Analyse 2: Calcul intégral et équations différentielles (56h), Algèbre 2: Réduction des endomorphismes et formes quadratiques (56h), Structure de la matière (56h), TEC 2 (56h), VH global du semestre 2 (336h)",
  "Les modules du semestre S3 de la formation DEUST (ID: MIPC) sont: Mécanique des Solides (56h), Analyse 3: Fonctions de plusieurs variables et calcul des intégrales multiples (56h), Statistique descriptive/probabilités (56h), Algorithmique et Programmation 2 (56h), Réactivité chimique (56h), TEC 3 (56h), VH global du semestre 3 (336h)",
  "Les modules du semestre S4 de la formation DEUST (ID: MIPC) sont: Electromagnétisme (56h), Mécanique quantique et Relativité (56h), Analyse 4: Séries de Fonctions et calcul des résidus (56h), Structure de données en C (56h), Chimie organique 1 (56h), Chimie minérale 1 (56h), VH global du semestre 4 (336h)",
  "Contact de la formation DEUST de MATEMATIQUES, INFORMATIQUE, PHYSIQUE, CHIMIE (MIPC): Département: Math, Informatique, Physique et Chimie, Responsable: M. ELLABIB Abdellatif, Email: a. ellabib@uca. ma",
  "Formation: Ingénieur\nNom du programme: ÉNERGIES RENOUVELABLES MOBILITÉ ÉLECTRIQUE\nID: ERME\n\nObjectifs du programme:\n- Former des ingénieurs polyvalents de haut niveau dans les domaines des Energies Renouvelables et de la Mobilité Electrique.\n- Procurer à ses lauréats l’ensemble des connaissances approfondies dans les différentes disciplines liées à ces domaines.",
  "Formation: Ingénieur\nNom du programme: ÉNERGIES RENOUVELABLES MOBILITÉ ÉLECTRIQUE\nID: ERME\n\nCompétences visées:\n- Connaissances approfondies dans les différentes disciplines liées aux Energies Renouvelables et à la Mobilité Electrique.\n- Compétences professionnelles élargies dans les secteurs liés à l'émergence de la mobilité électrique.",
  "Formation: Ingénieur\nNom du programme: ÉNERGIES RENOUVELABLES MOBILITÉ ÉLECTRIQUE\nID: ERME\n\nOpportunités professionnelles:\n- Augmentation des ressources humaines de cadres qualifiés.\n- Augmentation de la compétitivité des entreprises.\n- Transfert de technologies.\n- Diffusion du savoir-faire.\n- Initiation à la recherche appliquée.\n- Renforcement de l’ouverture de l’université sur son environnement socio-économique.",
  "Les modules du semestre S1 de la formation Ingénieur (ID: ERME) sont: Langues et Communication 1, Entreprenariat et Economie de l’entreprise, Analyse numérique, Semi-conducteurs pour l'énergétique, Electronique analogique, Traitement de signal, Electronique numérique 1, Thermodynamique appliquée",
  "Les modules du semestre S2 de la formation Ingénieur (ID: ERME) sont: Langues et Communication 2, Technique de gestion de l’entreprise, Probabilités et statistiques & Recherche opérationnelle, Programmation orientée Objet /Java, Bases des télécommunications et CEM, DSP et Microcontrôleurs, Electrotechnique 1, Automatique 1: systèmes asservis",
  "Les modules du semestre S3 de la formation Ingénieur (ID: ERME) sont: Langues et Communication 3, Management de l’environnement de l’entreprise, Dessin Industriel & Techniques de réalisation électronique et électrique, Réseaux de communication et Protocoles, Capteurs, Actionneurs et Automatisme, Electrotechnique 2, Système temps réel, Intelligence artificielle, Automatique 2: Systèmes échantillonnés",
  "Les modules du semestre S4 de la formation Ingénieur (ID: ERME) sont: Langues et Communication 4, Management de projet et gestion des services publics, Electronique de puissance, Systèmes logiques embarqués, Régulation industrielle, Réseaux locaux industriels et Supervision, Machines électriques, Projets & réalisations",
  "Les modules du semestre S5a de la formation Ingénieur (ID: ERME) sont: Matériaux et technologies photovoltaïques, Energie solaire photovoltaïque & thermique, Energie Eolienne: Gisement, production et dimensionnement, Commande des systèmes photovoltaïques et Eolienne, Audit et efficacité énergétique & Transition Énergétique / Normes, Softwares pour les énergies renouvelables et mobilité, Intégration des énergies renouvelables sur le réseau électrique, Stockage et Cogénération",
  "Les modules du semestre S5b de la formation Ingénieur (ID: ERME) sont: Commande avancée des machines, Réseaux Electriques, Gestion et Distribution, Mobilité électrique & Transports Nouveaux, Commande systèmes mobilité électrique – chaine de traction, Audit et efficacité énergétique & Transition énergétique / Normes, Softwares pour les énergies renouvelables et mobilité, Couplage des Centrales Solaires aux réseaux industriels, Installations Electriques intelligentes",
  "Les modules du semestre S6 de la formation Ingénieur (ID: ERME) sont: Projet de fin d’études",
  "Contact de la formation Ingénieur de ÉNERGIES RENOUVELABLES MOBILITÉ ÉLECTRIQUE (ERME): Département: Physique Appliquée, Responsable: M. BELKHYAT Driss, Email: driss. belkhayat@uca. ma",
  "Formation: Ingénieur\nNom du programme: Génie Civil\nID: GC\n\nObjectifs du programme:\n- Former des ingénieurs généralistes capables de s'adapter à la grande diversité du secteur du Génie Civil\n- Apporter des savoirs, savoir-faire et savoir-être nécessaires aux futurs cadres du secteur du BTP",
  "Formation: Ingénieur\nNom du programme: Génie Civil\nID: GC\n\nCompétences visées:\n- Polyvalence\n- Adaptabilité\n- Qualités humaines",
  "Formation: Ingénieur\nNom du programme: Génie Civil\nID: GC\n\nOpportunités professionnelles:\n- Possibilités d'emploi dans divers domaines d'activité\n- Professions de 'gros œuvres' et 'équipements techniques'",
  "Les modules du semestre S1 de la formation Ingénieur (ID: GC) sont: Mathématiques appliquées pour l'ingénieur, Outil informatique – Algorithme - Programmation, Méthodes numériques pour l'ingénieur, Statistique – Probabilité – Recherche opérationnelle, Thermodynamique appliquée – Transfert de chaleur, Electrotechnique - Electronique de base – Mesures, Economie de l'entreprise, Langues et communication 1",
  "Les modules du semestre S2 de la formation Ingénieur (ID: GC) sont: Mécanique des milieux continus -Mécanique des fluides, Hydraulique générale, Urbanisme - Topographie, Résistance des matériaux 1, Géologie de l'ingénieur, Matériaux de construction, Techniques de gestion de l'entreprise, Langues et communication 2",
  "Les modules du semestre S3 de la formation Ingénieur (ID: GC) sont: Construction métallique, Infrastructures d'eau et d'assainissement, Hydrologie, Béton armé 1, Architecture – Dessin industriel, Résistance des matériaux 2, Fonctions clés de l'entreprise, Langues et communication 3",
  "Les modules du semestre S4 de la formation Ingénieur (ID: GC) sont: Calcul des structures 1, Gestion du domaine public – Marchés publics, Voiries et Réseaux Divers, Géotechnique 1, Béton armé 2, Construction métallique bois et mixte, Management des projets de l'entreprise, Langues et communication 4",
  "Les modules du semestre S5 de la formation Ingénieur (ID: GC) sont: Procédés généraux de construction, Géotechnique 2, Routes, Calcul des structures 2 et Eléments finis, Technologie de bâtiment, Ponts – Ouvrages d'art, Aménagement et gestion des ressources en eau, Dynamiques des structures et études parasismiques",
  "Les modules du semestre S6 de la formation Ingénieur (ID: GC) sont: Projet de fin d'études",
  "Contact de la formation Ingénieur de Génie Civil (GC): Département: Génie Civil, Responsable: M. BOUFERRA Rachid, Email: r. bouferra@uca. ma",
  "Formation: Ingénieur\nNom du programme: Génie des Matériaux et Procédés\nID: GMP\n\nObjectifs du programme:\n- Former des cadres dans l'industrie de production, de transformation et de l'utilisation des matériaux organiques et inorganiques\n- Acquérir des connaissances théoriques et des compétences pratiques pour être en parfaite adéquation avec les besoins des industries Marocaines du secteur des matériaux",
  "Formation: Ingénieur\nNom du programme: Génie des Matériaux et Procédés\nID: GMP\n\nCompétences visées:\n- Connaissances théoriques et compétences pratiques\n- Adéquation avec les besoins des industries Marocaines du secteur des matériaux",
  "Formation: Ingénieur\nNom du programme: Génie des Matériaux et Procédés\nID: GMP\n\nOpportunités professionnelles:\n- Insertion dans la vie active\n- Exercice du savoir-faire dans les différentes industries de matériaux\n- Accès au troisième cycle (formation doctorale)",
  "Les modules du semestre S1 de la formation Ingénieur (ID: GMP) sont: Thermodynamique et catalyse hétérogène, Mécanique des milieux continus & Mécanique des fluides, Analyse numériques des systèmes linéaires, Chimie macromoléculaire, Propriétés optiques, électriques, magnétiques et thermiques des matériaux, Les matériaux polymères et les matériaux composites, Entreprenariat et Economie de l'entreprise, Langues & communication interpersonnelle",
  "Les modules du semestre S2 de la formation Ingénieur (ID: GMP) sont: Informatique I (Base des données et langage SQL: Access), Recherche opérationnelle et Statistique appliquée, Métallurgie physique, Physique des semi-conducteurs & Métrologie dimensionnelle, Résistance des Matériaux (RDM), Electrochimie, Technique de gestion de l'entreprise, Langues & La rédaction scientifique et technique",
  "Les modules du semestre S3 de la formation Ingénieur (ID: GMP) sont: Propriétés physico-chimiques des polymères, Mathématiques appliquées pour l'ingénieur, Machines thermiques et hydrauliques, Génie des procédés et Chimie Industrielle, Installation électrique et automatisme industriel, Propriétés Mécaniques des matériaux, Fonctions clés de l'entreprise, Langues et communication orale",
  "Les modules du semestre S4 de la formation Ingénieur (ID: GMP) sont: Caractérisations thermiques et thermomécaniques & Diffraction des rayons X, Caractérisations des surfaces et interface, Analyse des données & Plan d'expérience, Elaboration, caractérisation et propriétés des matériaux inorganiques, Spectrométries – Analyses chromatographiques, Métallurgie descriptive, Management de projet et gestion des services publics, Langues et la communication des organisations",
  "Les modules du semestre S5 de la formation Ingénieur (ID: GMP) sont: Matériaux et techniques de revêtements, Corrosion des matériaux, Construction et fabrication mécanique & Choix des matériaux et des procédés de fabrication, Mécanique des matériaux (Rupture -Fissuration - Propagation & Fatigue -Fiabilité), Contrôle non destructif, Capteurs & Instrumentations, La gestion de production industrielle, Management de la qualité, de la sécurité et de l'Environnement",
  "Les modules du semestre S6 de la formation Ingénieur (ID: GMP) sont: Projet de fin d’études",
  "Contact de la formation Ingénieur de Génie des Matériaux et Procédés (GMP): Département: Sciences Chimiques, Responsable: M. KHATIB Khalid, Email: k. khatib@uca. ma",
  "Formation: Ingénieur\nNom du programme: Ingénierie de l’Eau et des Géosciences\nID: IEGS\n\nObjectifs du programme:\n- former des ingénieurs capables de comprendre, gérer et valoriser les ressources en eau et les systèmes géologiques, dans une perspective de développement durable\n- maîtriser les outils et techniques modernes de modélisation, de prospection géophysique, d’analyse de données, et être formé à l’intégration de l’intelligence artificielle et du big data dans l’analyse et la gestion des ressources naturelles",
  "Formation: Ingénieur\nNom du programme: Ingénierie de l’Eau et des Géosciences\nID: IEGS\n\nCompétences visées:\n- gestion durable de l’eau\n- évaluation des risques naturels et des impacts environnementaux\n- innovation technologique\n- résolution de problèmes complexes liés aux ressources en eau et aux géosciences",
  "Formation: Ingénieur\nNom du programme: Ingénierie de l’Eau et des Géosciences\nID: IEGS\n\nOpportunités professionnelles:\n- larges perspectives professionnelles dans les secteurs public et privé\n- exercer dans les domaines de la gestion des ressources en eau, du dessalement, du traitement et de la réutilisation des eaux usées, de l’assainissement, de la géotechnique, ainsi que de la prévention et la gestion des risques naturels",
  "Les modules du semestre S1 de la formation Ingénieur (ID: IEGS) sont: Pétrographie/Minéralogie, Géologie Structurale, Dynamique sédimentaire, Stratigraphie appliquée, Pétrographie des Roches Cristallines, Informatique 1: Excel avancé, Langues étrangères",
  "Les modules du semestre S2 de la formation Ingénieur (ID: IEGS) sont: Géochimie appliquée, Géologie du Maroc, Hydrologie, Hydrogéologie appliquée, Bassins sédimentaires, Art et culture, Langues Etrangéres",
  "Les modules du semestre S3 de la formation Ingénieur (ID: IEGS) sont: Gisements Minéraux & Méthodes d'exploration, Alimentation en eau potable et Assainissement, Géologie des phosphates, des hydrocarbures conventionnels et non conventionnels, Ingénierie des Procédés de Dessalement d'eau de mer, Déminéralisation et Déferisation des Eaux, Géostatistiques, Informatique 2, Langues Etrangéres",
  "Les modules du semestre S4 de la formation Ingénieur (ID: IEGS) sont: Géomatique appliquée aux géosciences, Aménagement hydraulique et techniques de forages, Modélisation des hydrosystèmes, Géophysique, Hydrogéochimie et qualité des eaux, Management de projets et entrepreneuriat, Langues étrangères",
  "Les modules du semestre S5 de la formation Ingénieur (ID: IEGS) sont: Géotechnique, Sols et littoraux, Géoinformatique/Modélisation Géominière, Recherche Opérationnelle, École de terrain, Employment Skills, Langues étrangères",
  "Les modules du semestre S6 de la formation Ingénieur (ID: IEGS) sont: Projet de fin d'études (PFE)",
  "Contact de la formation Ingénieur de Ingénierie de l’Eau et des Géosciences (IEGS): Département: Géologie, Responsable: M. MOUSTADRAF Jalal, Email: j. moustadraf@uca. ac. ma",
  "Formation: Ingénieur\nNom du programme: Ingénierie en Finance et Actuariat\nID: IFA\n\nObjectifs du programme:\n- Mettre à la disposition du marché du travail des cadres avec un profil d'ingénieurs mathématiciens spécialisés capables de faire face à des problèmes réels dans divers domaines, notamment en finance de marché et assurance.\n- Donner aux étudiants des connaissances et des compétences améliorant l'employabilité nécessaires, tels que la détermination du problème et stratégies de résolutions analytiques, des compétences en finance quantitatives et assurance.",
  "Formation: Ingénieur\nNom du programme: Ingénierie en Finance et Actuariat\nID: IFA\n\nCompétences visées:\n- Méthodes statistiques, économétriques, numériques et financières\n- Analyse et simulation de phénomènes d'origine économique, financier ou actuariel",
  "Formation: Ingénieur\nNom du programme: Ingénierie en Finance et Actuariat\nID: IFA\n\nOpportunités professionnelles:\n- Partenariats privilégiés dans les domaines de la finance et de l'actuariat\n- Carrières de responsables et analystes en ingénierie financière et actuarielle",
  "Les modules du semestre S1 de la formation Ingénieur (ID: IFA) sont: Mesures et Intégration, Topologie et Calcul Différentiel, Analyse Numérique, Statistique, Probabilités I, Langage C et C++, Entreprenariat et économie de l'entreprise (3ee), Langues et communication 1",
  "Les modules du semestre S2 de la formation Ingénieur (ID: IFA) sont: Analyse fonctionnelle et EDP, Recherche Opérationnelle, Micro économie, Mathématiques Financières I: Gestion Obligataire, Modèles Linéaires, Probabilités II, Techniques de gestion de l'entreprise, Langues et communication 2",
  "Les modules du semestre S3 de la formation Ingénieur (ID: IFA) sont: Bases de données et VBA, Mathématiques Financières II: Gestion de Portefeuille, Processus stochastiques, Data Mining et Application à la finance, Économétrie des variables qualitatives et données de Panel, Langues et communication 3: Anglais technique, Décisions financières et création de valeurs, Actuariat I: Modèles Actuariels",
  "Les modules du semestre S4 de la formation Ingénieur (ID: IFA) sont: Finance Islamique et Takaful, Économétrie des séries temporelles, Calcul stochastique, Macro économie, Réglementation des Banques et Assurances, Instruments financiers, Actuariat II: Assurance Vie, Analyse Technique",
  "Les modules du semestre S5 de la formation Ingénieur (ID: IFA) sont: Économétrie de la finance, Modèles discrets en finance, Langues et communication 4: Tutorat au concours SOA/CAS, Courbe des taux, Actuariat III: Assurance non -Vie, Modèles continus en finance, Méthodes numériques: EDP et Méthode Monte Carlo, Gestion des risques en finance",
  "Les modules du semestre S6 de la formation Ingénieur (ID: IFA) sont: Projet de fin d’études",
  "Contact de la formation Ingénieur de Ingénierie en Finance et Actuariat (IFA): Département: Mathématiques, Responsable: M. DAAFI Boubker, Email: b. daafi@uca. ma",
  "Formation: Ingénieur\nNom du programme: Ingénierie en Réseaux et Systèmes d'Information\nID: IRSI\n\nObjectifs du programme:\n- Former des professionnels avec des spécialisations en Réseaux ou en Systèmes d'Information\n- Former des ingénieurs en informatique spécialistes des systèmes d'information et Réseaux",
  "Formation: Ingénieur\nNom du programme: Ingénierie en Réseaux et Systèmes d'Information\nID: IRSI\n\nCompétences visées:\n- Administration des data center et bases de données\n- Administration des réseaux\n- Définition d'architecture des systèmes d'information\n- Développement d'applications destinées à améliorer l'efficacité de l'entreprise\n- Gestion de projet et d'équipe de développement sur les systèmes d'information",
  "Formation: Ingénieur\nNom du programme: Ingénierie en Réseaux et Systèmes d'Information\nID: IRSI\n\nOpportunités professionnelles:\n- Occuper des postes de chefs de projet au sein de toute équipe de conduite de projet\n- Être administrateur de réseaux capables d'installer, de configurer et d'administrer des environnements distribués dans les entreprises\n- Répondre aux profils de décideurs pouvant mettre au service d'une entreprise les moyens nécessaires pour l'introduction des nouvelles technologies de l'Information et de la communication",
  "Les modules du semestre S1 de la formation Ingénieur (ID: IRSI) sont: Microprocesseur et programmation assembleur, Linux/Unix, Programmations Orientées Objet Cpp, Les réseaux, Concepts des Bases de Données, Programmation Evénementielle. NET, Entreprenariat et économie de l'entreprise (3ee), Langues et communication 1",
  "Les modules du semestre S2 de la formation Ingénieur (ID: IRSI) sont: Architectures Clients/Serveur, Méthodologie d'analyse, TCP/IP et interconnexion des réseaux, Bases de Données Relationnelles, Statistique et théorie des graphes, Programmations Orientées Objet Java - IHM, Techniques de gestion de l'entreprise, Langues et communication 2",
  "Les modules du semestre S3 de la formation Ingénieur (ID: IRSI) sont: Conception des Systèmes d'Information, Systèmes d'Exploitation, Conception Objet UML, Réseaux Mobiles, Administration de Bases de Données, Programmation Mobile, Fonctions clés de l'Entreprise, Langues et communication 3",
  "Les modules du semestre S4 de la formation Ingénieur (ID: IRSI) sont: Conduite de Projet Informatique, L'Intelligence Artificielle, Programmation Concurrentielle et Réseau, Bases de Données Reparties, Méthodes Agiles, Analyse de Données, Management de projet et gestion des services publics, Langues et communication 4",
  "Les modules du semestre S5 de la formation Ingénieur (ID: IRSI) sont: Administration des réseaux, Sécurité des réseaux, Bases de Données Semi - Structurées, Entrepôt de Données, Management des Systèmes d'Information, Systèmes Répartis, Urbanisation et Gouvernance des Systèmes d'Information, Bases de Données Objet Relationnelles, Développement Web Java EE",
  "Les modules du semestre S6 de la formation Ingénieur (ID: IRSI) sont: Projet de fin d'études",
  "Contact de la formation Ingénieur de Ingénierie en Réseaux et Systèmes d'Information (IRSI): Département: Informatique, Responsable: M. DAROUICHI Aziz, Email: az. darouichi@uca. ma",
  "Formation: Ingénieur\nNom du programme: ISA: Industrie et Sécurité des Aliments\nID: ISA\n\nObjectifs du programme:\n- Permettre aux lauréats d’assurer la production, la sécurité et la conformité des produits agroalimentaires.\n- Acquérir les compétences nécessaires à la maîtrise technique à conduire un procédé.\n- Avoir une parfaite connaissance de la matière première et des produits finis.\n- Acquérir une connaissance approfondie des dangers microbiologiques et chimiques liés à l’alimentation et de leurs maîtrises.\n- Avoir la capacité d’intégrer l’aspect nutritionnel dans la formulation des aliments.\n- Être au fait des réglementations nationale et internationale et savoir les appliquer.\n- Contribuer à l’élaboration de normes relatives à la qualité et à la sécurité des produits alimentaires et de leur production.\n- Acquérir les compétences nécessaires à la conduite de projets (y compris en R&D) de la conception à la réalisation.\n- Acquérir l’aptitude de communiquer de manière convaincante et professionnelle en interne et en externe.\n- Acquérir de l’autonomie dans l’apprentissage continu tout au long de la carrière.\n- Acquérir l’aptitude de travailler en équipe dans le milieu professionnel tout en étant indépendant.\n- Être conscient des enjeux (nutritionnels, sociétaux, économiques, .. .) de l’alimentation à court, moyen et long termes.",
  "Formation: Ingénieur\nNom du programme: ISA: Industrie et Sécurité des Aliments\nID: ISA\n\nCompétences visées:\n- Maîtrise technique à conduire un procédé\n- Connaissance de la matière première et des produits finis\n- Connaissance approfondie des dangers microbiologiques et chimiques liés à l’alimentation\n- Capacité d’intégrer l’aspect nutritionnel dans la formulation des aliments\n- Réglementations nationale et internationale\n- Conduite de projets (y compris en R&D)\n- Communication de manière convaincante et professionnelle\n- Autonomie dans l’apprentissage continu\n- Travail en équipe dans le milieu professionnel\n- Conscience des enjeux (nutritionnels, sociétaux, économiques, .. .) de l’alimentation",
  "Formation: Ingénieur\nNom du programme: ISA: Industrie et Sécurité des Aliments\nID: ISA\n\nOpportunités professionnelles:\n- Postes de responsabilité dans les industries alimentaires\n- Ingénieur qualité\n- Ingénieur procédés\n- Cadre dans les centres de contrôles et dans les Cabinets Conseil\n- Responsable qualité dans les IAA\n- Responsable dans des centres de recherche et développement\n- Cadre conseil ou décideur, spécialisé dans le domaine de l’alimentaire",
  "Les modules du semestre S1 de la formation Ingénieur (ID: ISA) sont: Enzymologie, Ingénierie Génétique, Méthodes optiques et électrochimiques d’analyse, Langues et communication 1, Bio-statistique, Biochimie métabolique, Bases des données Relationnelles & langage SQL, Entreprenariat et Economie de l’entreprise (3EE)",
  "Les modules du semestre S2 de la formation Ingénieur (ID: ISA) sont: Biochimie des aliments, Analyse numérique, Langues et communication 2, Microbiologie fondamentale, Analyse de données et Plan d’expérience, Mécanique des fluides, Alimentation et Nutrition, Techniques de gestion de l’entreprise (TGE)",
  "Les modules du semestre S3 de la formation Ingénieur (ID: ISA) sont: Génie des procédés 1, Thermodynamique pour l’ingénieur, Microbiologie alimentaire, Langues et communication 3, Dégradation et conservation des aliments, Techniques analytiques et séparatives, Génie industriel et Gestion de production, Management de l’environnement de l’entreprise (M2EE)",
  "Les modules du semestre S4 de la formation Ingénieur (ID: ISA) sont: Physique industrielle, Chimie-Physique des aliments, formulation et analyse sensorielle, Management de la qualité, Elaboration et transformation des aliments d’origine végétale, Elaboration et transformation des aliments d’origine animale, HACCP et Maîtrise de l’Hygiène dans les industries alimentaires, Génie des procédés 2, Management des projets et gestion des services publics (MPGSP)",
  "Les modules du semestre S5a de la formation Ingénieur (ID: ISA) sont: Coaching et Préparation à la professionnalisation, Bases théoriques et législatives de la sécurité sanitaire des aliments/Traçabilité, Bactéries et moisissures pathogènes dans les aliments, Parasitologie et Virologie Alimentaires, Toxicologie alimentaire, Référentiels de Management de la sécurité sanitaire des aliments, Sécurité des aliments: Risques liés à l’alimentation et à la nutrition, Environnement et IAA Management d’environnement et la sécurité",
  "Les modules du semestre S5b de la formation Ingénieur (ID: ISA) sont: Coaching et Préparation à la professionnalisation, Caractérisation des MP et leur transformation, Génie de la formulation, Outils de l’ingénieur, Rhéologie et développement industriel des, Management de l’innovation, Réglementation/Référentiels, Projet pluridisciplinaire: Création alimentaire innovante",
  "Les modules du semestre S6 de la formation Ingénieur (ID: ISA) sont: Projet de fin d’études",
  "Contact de la formation Ingénieur de ISA: Industrie et Sécurité des Aliments (ISA): Département: Biologie, Responsable: M. CHAKIR Mohammed, Email: m. chakir@uca. ma",
  "Formation: Licence\nNom du programme: Bio-Analyses\nID: BA\n\nObjectifs du programme:\n- Acquérir des compétences en termes de techniques et méthodes récentes dédiées à l'identification, la quantification et l'analyse des échantillons biologiques et des prélèvements et comprendre l’intérêt des approches analytiques.\n- S’initier à la démarche qualité permettant d'assurer la qualité du résultat et sa traçabilité.",
  "Les modules du semestre S5 de la formation Licence (ID: BA) sont: Technique d’Analyses Chimiques et Biochimiques (56h), Techniques de Biologie Moléculaire (56h), Bio-Statistiques (56h), Génétique fondamentale (56h), Physiologie Animale (56h), Option: Bio-Analyses Médicales: Immunologie fondamentale et appliquée (56h), Option: Bio-Analyses Environnementales: Biodiversité et principes d’Ecologie (56h), VH global du semestre 5 (336h)",
  "Les modules du semestre S6 de la formation Licence (ID: BA) sont: Option: Bio-analyses Médicales, Bactériologie, Mycologie virologie et Agents antimicrobiens (56h), Hématologie / Parasitologie Médicale (56h), Biochimie clinique et Génétique Médicale (56h), PFE (168h), Option: Bio-analyses Environnementales, Toxicologie (56h), Techniques d’Analyses biologiques de l’environnement (56h), Chimie de l’environnement (56h), PFE (168h), VH global du semestre 6 (336h)",
  "Contact de la formation Licence de Bio-Analyses (BA): Département: Biologie, Responsable: M. EL HACHIMI My. Youssef, Email: m. elhachimi@uca. ma",
  "Formation: Licence\nNom du programme: BIOTECHNOLOGIE DES PLANTES (BP)\nID: BP\n\nObjectifs du programme:\n- La formation met l'accent sur l'intégration des biotechnologies végétales dans les secteurs de l’agrophysiologie et de l'agronomie, de la génétique et de l'amélioration des plantes, de la protection des cultures et sur l'acquisition des critères d'appréciation et des techniques d'évaluation de la qualité et sécurité des productions végétales de grand intérêt économi que pour le Maroc.\n- Il s'agit d'une filière professionnalisante permettant aux candidats de maîtriser parfaitement les conditions de la production agricole et les différentes dimensions de l’amélioration et de la préservation de la qualité et de la sécurité des productions végétales, avec un souci de préservation de l’environnement.\n- La formation prend largement en compte les concepts liés au développement durable, les enjeux économiques et réglementaires et la problématique sociétale.",
  "Formation: Licence\nNom du programme: BIOTECHNOLOGIE DES PLANTES (BP)\nID: BP\n\nCompétences visées:\n- Raisonner l’exploitation, l’amélioration et la valorisation des productions végétales\n- Gérer sur le plan technique et réglementaire les contraintes en matière d’utilisation de variétés, de production végétale, de transformation, de mise sur le marché et du contrôle de la qualité et sécurité des productions végétales\n- Appréhender le contexte économique des entreprises et des filières agri-coles\n- Créer et gérer des entreprises d’exploitation, d’amélioration, de valorisation ou de transformation des productions végétales",
  "Formation: Licence\nNom du programme: BIOTECHNOLOGIE DES PLANTES (BP)\nID: BP\n\nOpportunités professionnelles:\n- Les principaux débouchés et insertions professionnelles concernent notamment les organismes professionnels agricoles, les établissements et firmes de production et commercialisation des semences et plants, les services de contrôle officiels ou interprofessionnels, l’industrie des produits phytosanitaires, les entreprises des productions spécialisées (horticulture, serriste), les services techniques et commerciaux des industries agricoles, de la transformation et de la valorisation et l’amélioration des productions végétales, de la certification et réglementation de commercialisation et de la phytoprotection et de la gestion de l'environnement.",
  "Les modules du semestre S5 de la formation Licence (ID: BP) sont: Pédologie/ Nutrition hydrique et minérale des plantes (56h), Biologie moléculaire (56h), Génétique (56h), Nutrition azotée et carbonée des plantes / Stress abiotiques (56h), Croissance et développement des plantes (56h), Microbiologie du sol / Techniques d’analyses (56h)",
  "Les modules du semestre S6 de la formation Licence (ID: BP) sont: Cultures sous serre et systématique des plantes d’intérêt économique (56h), Phytopathologie et certification des productions végétales (56h), Biotechnologie végétale (56h), PFE (168h)",
  "Contact de la formation Licence de BIOTECHNOLOGIE DES PLANTES (BP) (BP): Département: Biologie, Responsable: Mme DOUNAS Hanane, Email: h. dounas@uca. ma",
  "Formation: Licence\nNom du programme: Eau et Environnement. Option: Exploration et Exploitation des Ressources en Eau\nID: EEERE\n\nObjectifs du programme:\n- Avoir une formation spécialisée en Eau et Environnement pour s'intégrer dans le milieu professionnel ou suivre des études de Master et/ou Doctorat National ou international",
  "Formation: Licence\nNom du programme: Eau et Environnement. Option: Exploration et Exploitation des Ressources en Eau\nID: EEERE\n\nOpportunités professionnelles:\n- Débouchés dans des bureaux d'études, des Compagnies de recherche et d'exploitation des sources hydriques, des organismes publics ou privés opérant dans le secteur eau et environnement",
  "Les modules du semestre S5 de la formation Licence (ID: EEERE) sont: Climatologie – Hydrologie (56h), Sols et Risques majeurs (56h), Géologie structurale (56h), Dynamique sédimentaire (56h), Géologie du Maroc (56h), Hydrogéologie (56h), VH global du semestre 5 (336h)",
  "Les modules du semestre S6 de la formation Licence (ID: EEERE) sont: Techniques de forages et Aménagements hydrauliques (56h), Géophysique (56h), Hydrogéochimie et qualité des eaux (56h), PFE (186h), VH global du semestre 6 (336h)",
  "Contact de la formation Licence de Eau et Environnement. Option: Exploration et Exploitation des Ressources en Eau (EEERE): Département: Sciences de la Terre, Responsable: SAIDI Mohamed Elmehdi, Email: m. saidi@uca. ma",
  "Formation: Licence\nNom du programme: GEOLOGIE APPLIQUEE AUX RESSOURCES MINIERES\nID: GARM\n\nObjectifs du programme:\n- former des étudiants opérationnels dans le secteur minier\n- préparer les étudiants à une carrière de chercheur ou de spécialiste de haut niveau dans le domaine des sciences de la terre\n- faire fructifier la coopération avec les partenaires économiques régionaux",
  "Formation: Licence\nNom du programme: GEOLOGIE APPLIQUEE AUX RESSOURCES MINIERES\nID: GARM\n\nCompétences visées:\n- Exploration minière\n- Métallogénie\n- Pétrologie\n- Géologie structurale\n- Sédimentologie\n- Stratigraphie",
  "Formation: Licence\nNom du programme: GEOLOGIE APPLIQUEE AUX RESSOURCES MINIERES\nID: GARM\n\nOpportunités professionnelles:\n- intégration auprès de différents organismes régionaux publics et privés\n- insertion dans des petites entreprises minières ou dans des bureaux d'études",
  "Les modules du semestre S5 de la formation Licence (ID: GARM) sont: Minéralogie (56h), Pétrographie Des Roches Cristallines (56h), Géologie structurale (56h), Dynamique sédimentaire (56h), Géologie du Maroc (56h), Métallogénie endogène (56h)",
  "Les modules du semestre S6 de la formation Licence (ID: GARM) sont: Métallogénie Exogène/Géologie des Hydrocarbures (56h), Géophysique (56h), Prospection géochimique - Géoinformatique (56h), PFE (168h)",
  "Contact de la formation Licence de GEOLOGIE APPLIQUEE AUX RESSOURCES MINIERES (GARM): Département: Sciences de la Terre, Responsable: ERRAGRAGUI Mohammed, Email: erragragui1983@gmail. com",
  "Formation: Licence\nNom du programme: Mathématiques et Informatique Appliquées aux Sciences de l’ingénieur\nID: MIASI\n\nObjectifs du programme:\n- Consolider les connaissances scientifiques générales de l’étudiant dans des domaines aussi diverses que les mathématiques, la physique, l’informatique, la culture de l’entreprise. ..\n- Développer les capacités de l’étudiant à raisonner, à poser et à résoudre les problèmes\n- Acquérir les compétences nécessaires pour aborder les domaines novateurs en ingénierie mathématiques et en informatique",
  "Formation: Licence\nNom du programme: Mathématiques et Informatique Appliquées aux Sciences de l’ingénieur\nID: MIASI\n\nCompétences visées:\n- Maîtrise des outils mathématiques, théoriques et appliquées, nécessaires aux sciences de l’ingénieur",
  "Formation: Licence\nNom du programme: Mathématiques et Informatique Appliquées aux Sciences de l’ingénieur\nID: MIASI\n\nOpportunités professionnelles:\n- Débouchés possibles après 4 semestres (DEUST MIP): concours d'entrée aux écoles nationales supérieures d'ingénieurs (INPT, EMI, EHTP, ENSIAS, ENSIA, ENSA. .. )\n- Débouchés possibles avec la licence Mathématiques et Informatique Appliquées aux Sciences de l’ingénieur (MIASI):\n- Divers concours administratifs\n- Insertion professionnelle dans le secteur des services en Informatique et en Ingénierie (Banques, Bureaux d’études, entreprises. .. )\n- Accès aux masters\n- Concours d’accès aux filières d’ingénieur.\n- Accès en deuxième année des filières d’ingénieur et particulièrement celles des FST",
  "Les modules du semestre S5 de la formation Licence (ID: MIASI) sont: Topologie (56h), Algèbre 3 (56h), Programmation Orientée Objet C++ (56h), Intégration (56h), Base de données (56h), Statistiques (56h)",
  "Les modules du semestre S6 de la formation Licence (ID: MIASI) sont: Calcul différentiel (56h), Outils de calcul Scientifique (56h), Géométrie des courbes et surfaces (56h), PFE (168h)",
  "Contact de la formation Licence de Mathématiques et Informatique Appliquées aux Sciences de l’ingénieur (MIASI): Département: Mathématiques, Responsable: M. BEN TBIB Abdeslem Hafid, Email: a. bentbib@uca. ma",
  "Formation: Licence\nNom du programme: PHYSICO-CHIMIE DES MATERIAUX\nID: PCM\n\nObjectifs du programme:\n- La formation se veut généraliste et aspire à inculquer des connaissances de base dans le domaine des matériaux.\n- Les trois principaux axes sont l'élaboration, les propriétés et les applications ainsi que les corrélations entre ces trois approches qui constituent la base pyramidale de la Science des matériaux.",
  "Formation: Licence\nNom du programme: PHYSICO-CHIMIE DES MATERIAUX\nID: PCM\n\nCompétences visées:\n- Compétences techniques solides\n- Contrôle qualité des matériaux",
  "Formation: Licence\nNom du programme: PHYSICO-CHIMIE DES MATERIAUX\nID: PCM\n\nOpportunités professionnelles:\n- Débouchés immédiats vers des métiers techniques\n- Intégration facile en différents masters spécifiés dans le domaine des matériaux",
  "Les modules du semestre S5 de la formation Licence (ID: PCM) sont: Thermodynamique I & II (56h), Réactivité en Chimie Organique & Organométallique (56h), Techniques d’analyse et de caractérisation des matériaux I (56h), Chimie de coordination & Techniques d’analyse et de caractérisation des matériaux II (56h), Cinétique et Catalyse hétérogène & Eléments de Génie des Procédés (56h), Gestion de la production industrielle & Communication des entreprises (56h)",
  "Les modules du semestre S6 de la formation Licence (ID: PCM) sont: Electrochimie, thermodynamique cinétique et applications industrielles (56h), Métallurgie & Plasturgie (56h), Céramique, matériaux de construction & verres (56h), PFE (168h)",
  "Contact de la formation Licence de PHYSICO-CHIMIE DES MATERIAUX (PCM): Département: Sciences Chimiques, Responsable: Mme KHACHANE MANAR, Email: m. khachane@uca. ac. ma",
  "Formation: Licence\nNom du programme: SYSTEMES INFORMATIQUES REPARTIS\nID: SIR\n\nObjectifs du programme:\n- La formation de spécialistes dans la maintenance de systèmes d'information basés sur des architectures réparties complexes, capable de concevoir, de développer et d’administrer des bases de données, des applications Internet et Intranet sans oublier le développement d’applications ré parties et nomade (téléphonie mobile, réseau informatique sans fil, .. .).\n- Les lauréats seront capables de résoudre les problèmes posés par l'hétérogénéité des machines, des programmes et des données. De mettre en œuvre de s applications correspondantes aux d ifférents types de conceptions.",
  "Formation: Licence\nNom du programme: SYSTEMES INFORMATIQUES REPARTIS\nID: SIR\n\nCompétences visées:\n- Développement, en programmation Web et architectures Répartie (J2EE), en systèmes d’Informations et Bases de Données avancées et Réparties, en IHM et en réseau",
  "Formation: Licence\nNom du programme: SYSTEMES INFORMATIQUES REPARTIS\nID: SIR\n\nOpportunités professionnelles:\n- Gestion des Systèmes d'Information\n- Gestion, développement et administration Bases de Données\n- Gestion et Développement d’applications Internet et Intranet\n- Développement d’applications réparties",
  "Les modules du semestre S5 de la formation Licence (ID: SIR) sont: Programmation Orientée Objet Java (56h), Système d’exploitation (56h), UML et Méthodes Agiles (56h), SGBD/SGBDR (56h), Réseaux Informatiques (56h), Bases de Données Répartie (56h)",
  "Les modules du semestre S6 de la formation Licence (ID: SIR) sont: IHM (56h), Programmation WEB (56h), Architectures Réparties (56h), PFE (168h)",
  "Contact de la formation Licence de SYSTEMES INFORMATIQUES REPARTIS (SIR): Département: Informatique, Responsable: Mme AMIR Laïla, Email: l. amir@uca. ma",
  "Formation: Master\nNom du programme: Exploration et Valorisation des Géoressources\nID: EVG\n\nObjectifs du programme:\n- Formation de cadres supérieurs hautement qualifiés et polyvalents\n- Connaissances techniques et scientifiques\n- Opérationnels dans le secteur public ou privé\n- Poursuite des études doctorales dans les domaines de l’exploration, de la valorisation et de la gestion des ressources minérales et hydriques et de la protection de l’environnement",
  "Formation: Master\nNom du programme: Exploration et Valorisation des Géoressources\nID: EVG\n\nCompétences visées:\n- Cadres supérieurs hautement qualifiés dans les domaines de l’exploration, la valorisation et la gestion des ressources minérales\n- Cadres supérieurs hautement qualifiés dans les domaines de l’exploration et la gestion des ressources en eau\n- Protection de l’environnement",
  "Formation: Master\nNom du programme: Exploration et Valorisation des Géoressources\nID: EVG\n\nOpportunités professionnelles:\n- Domaine de la géologie minière\n- Domaine des Sciences de l’eau et de l’environnement",
  "Formation: Master\nNom du programme: Exploration et Valorisation des Géoressources\nID: EVG\n\nConditions d'admission:\n- Diplômes requis: licence Sciences et Techniques, fondamentale ou professionnelle en Géologie\n- Prérequis pédagogiques spécifiques: Enseignements de base en géologie fondamentale et appliquée",
  "Les modules du semestre S1 de la formation Master (ID: EVG) sont: Géologie structurale (56h), Bassins sédimentaires (56h), Stratigraphie appliquée (56h), Hydrogéologie (56h), Pétrologie (56h), Langues étrangères et culture 1 (56h), VH global du semestre 1 (336h)",
  "Les modules du semestre S2 de la formation Master (ID: EVG) sont: Géochimie (56h), Géophysique appliquée (56h), Télédétection -SIG (56h), Géostatistiques (56h), Soft Skill (56h), Langues étrangères et culture 2 (56h), VH global du semestre 2 (336h)",
  "Les modules du semestre S3 de la formation Master (ID: EVG) sont: Typologie des Gisements métalliques (56h), Exploration géochimique (56h), Géologie des Phosphates et Des hydrocarbures conventionnels et non conventionnels (56h), Exploitation minière et métallurgie extractive/Substances Utiles (56h), Valorisation des Minerais (56h), Langues étrangères et culture 3 (56h), VH global du semestre 3 (Option Mine) (336h)",
  "Les modules du semestre S3 de la formation Master (ID: EVG) sont: hydrologie quantitative (56h), Hydrogéochimies élémentaire et isotopique (56h), Dynamique littorale (56h), Paléoclimat et paléoenvironnement - Gestion des ressources en eau (GIRE) (56h), Pollution dépollution du milieu/ Gestion des déchets (56h), Langues étrangères et culture 3 (56h), VH global du semestre 3 (Option Eau et Environnement) (336h)",
  "Les modules du semestre S4 de la formation Master (ID: EVG) sont: STAGE // SOFT EMPLOYEMENT (336h), VH global du semestre 4 (336h)",
  "Contact de la formation Master de Exploration et Valorisation des Géoressources (EVG): Département: Sciences de la Terre, Responsable: Mme REDDAD Aicha, Email: a. reddad@uca. ma",
  "Formation: Master\nNom du programme: Matériaux Avancés\nID: MA\n\nObjectifs du programme:\n- Donner à l'étudiant des connaissances et des compétences dans le domaine des matériaux\n- Former des cadres dans le domaine de l'élaboration, la mise en forme et la caractérisation de différents matériaux",
  "Formation: Master\nNom du programme: Matériaux Avancés\nID: MA\n\nCompétences visées:\n- Techniques d'élaboration et de mise en forme des Matériaux\n- Techniques de Caractérisation\n- Matériaux avancés et procédés\n- Modélisation des systèmes physiques\n- Energie Solaire (Applications des matériaux: solaire, optoélectronique, .. .. )",
  "Formation: Master\nNom du programme: Matériaux Avancés\nID: MA\n\nOpportunités professionnelles:\n- Rejoindre les laboratoires des universités ou les organismes de recherche publics\n- Intégrer directement les entreprises qui ont une activité liée au domaine des matériaux",
  "Formation: Master\nNom du programme: Matériaux Avancés\nID: MA\n\nConditions d'admission:\n- Diplômes requis: Licence en sciences des matériaux ou tout diplôme équivalent\n- Prérequis pédagogiques spécifiques: Modules de base de la Physique (DEUST et DEUG), Physique du solide, Physique statistique, Mécanique des fluides, Résistance des matériaux.",
  "Les modules du semestre S1 de la formation MASTER (ID: MA) sont: Propriétés physiques des matériaux (56h), Modélisation et analyses des systèmes (56h), Capteurs et instrumentations (56h), Thermodynamique de l’état de solide (56h), Mécanique quantique avancée (56h), Langues étrangères et cultures 1 (56h), VH global du semestre 1 (336h)",
  "Les modules du semestre S2 de la formation MASTER (ID: MA) sont: Technologie des couches minces et Technologie de fabrication des composants et circuits électronique (56h), Matériaux composites (56h), Comportement mécanique des matériaux (56h), Physique des jonctions et des hétéro-structures semi-conductrices (56h), Soft Skills (56h), Langues étrangères et cultures 2 (56h), VH global du semestre 2 (336h)",
  "Les modules du semestre S3 de la formation MASTER (ID: MA) sont: Matériaux pour l’optoélectronique et solaire (56h), Matériaux pour l’aéronautique (56h), Comportement Tribologique des matériaux (56h), Matériaux pour l’énergie (56h), Caractérisation des matériaux (56h), Langues étrangères et cultures 3 (56h), VH global du semestre 3 (336h)",
  "Les modules du semestre S4 de la formation MASTER (ID: MA) sont: STAGE // SOFT EMPLOYEMENT (336h), VH global du semestre 4 (336h)",
  "Contact de la formation MASTER de Matériaux Avancés (MA): Département: Physique Appliquée, Responsable: M. EL HICHOU Ahmed, Email: a. elhichou@uca. ma",
  "Formation: Master\nNom du programme: BIOTECHNOLOGIE VEGETALE POUR L’AMELIORATION DES PLANTES\nID: MABIOVA\n\nObjectifs du programme:\n- d’acquérir les progrès récents dans divers domaines fondamentaux et appliqués liés aux biotechnologies des productions agricoles\n- de comprenàre et d’établir des liens entre les contraintes environnementales et économiques et les biotechnologies agricoles\n- d’acquérir des capacités d’analyse et de synthèse et des outils méthodologiques leur permettant de gérer, d’innover et de proposer des gestes professionnels en adéquation avec l’évolution des exigences du nouveau contexte de l’agriculture moderne, durable et respectueuse de son environnement\n- de suivre l’évolution des biotechnologies et permettre leur transfert vers la production agricole et le monde économique",
  "Formation: Master\nNom du programme: BIOTECHNOLOGIE VEGETALE POUR L’AMELIORATION DES PLANTES\nID: MABIOVA\n\nCompétences visées:\n- d’être intégré dans la vie active dans divers secteurs\n- de créer leurs propres entreprises\n- de s’engager dans des études doctorales",
  "Formation: Master\nNom du programme: BIOTECHNOLOGIE VEGETALE POUR L’AMELIORATION DES PLANTES\nID: MABIOVA\n\nOpportunités professionnelles:\n- d’acquérir des bases fondamentales, scientifiques et technologiques leur permettant\n- de suivre l’évolution des biotechnologies et permettre leur transfert vers la production agricole et le monde économique",
  "Formation: Master\nNom du programme: BIOTECHNOLOGIE VEGETALE POUR L’AMELIORATION DES PLANTES\nID: MABIOVA\n\nConditions d'admission:\n- Titulaire d’une Licence en Biologie ou d’un diplôme équivalent\n- Biologie Cellulaire, Chimie générale et organique, Biochimie, Microbiologie générale, Biologie Végétale, Physiologie Végétale, Génétique Fondamentale et Biologie Moléculaire",
  "Les modules du semestre S1 de la formation MASTER (ID: MABIOVA) sont: Enzymologie et Biochimie des plantes (56h), Omique et bioinformatique pour les biotechnologies (56h), Irrigation et Fertilisation des Cultures (56h), Ressources génétiques / Biostatistiques (56h), Interaction plantes -Microorganismes bénéfiques, Applications en agriculture durable (56h), Langues étrangères et Cultures 1 (56h), VH global du semestre 1 (336h)",
  "Les modules du semestre S2 de la formation MASTER (ID: MABIOVA) sont: Biotechnologie des PAM, des algues et leurs biomolécules (56h), Développement des Plantes et stress abiotiques (56h), Systèmes de production agricole et Agroécologie (56h), Post récolte et Transformation des Productions Végétales (56h), SOFT SKILLS (56h), Langues étrangères et Cultures 2 (56h), VH global du semestre 2 (336h)",
  "Les modules du semestre S3 de la formation MASTER (ID: MABIOVA) sont: Biotechnologies / Amélioration des Plantes (56h), Mangement de la Qualité/ Certification des Semences et Plants (56h), Epidémiologie et outils de contrôle des Maladies et ravageurs des plantes (56h), Marqueurs moléculaires et cartographie génétique (56h), Communication et rédaction scientifique / Entreprenariat - Management de projet personnel (56h), Langues étrangères et Cultures 3 (56h), VH global du semestre 3 (336h)",
  "Les modules du semestre S4 de la formation MASTER (ID: MABIOVA) sont: STAGE // SOFT EMPLOYEMENT (336h), VH global du semestre 4 (336h)",
  "Contact de la formation MASTER de BIOTECHNOLOGIE VEGETALE POUR L’AMELIORATION DES PLANTES (MABIOVA): Département: Biologie, Responsable: Mme CHERIFI Ouafa, Email: o. cherifi@uca. ma",
  "Formation: Master\nNom du programme: Modélisation des Sciences de Données en Ingénierie Mathématique\nID: MODASIM\n\nObjectifs du programme:\n- dispenser aux étudiants un enseignement de haut niveau dans le domaine de la modélisation mathématique en sciences de données\n- maîtrise des différentes méthodes d’analyse et de traitement liées aux que les outils informatique nécessaires à l’an alyse et la résolution de tels problèmes\n- initiant les lauréats à un parcours en recherche dans ce domaine",
  "Formation: Master\nNom du programme: Modélisation des Sciences de Données en Ingénierie Mathématique\nID: MODASIM\n\nCompétences visées:\n- Acquisition des fondamentales des sciences de données\n- Maitrise des outils mathématiques d’analyse des données\n- Réalisation et conception d’applications décisionnelles\n- Initiation à la recherche scientifique dans le domaine des sciences de données",
  "Formation: Master\nNom du programme: Modélisation des Sciences de Données en Ingénierie Mathématique\nID: MODASIM\n\nOpportunités professionnelles:\n- Chefs de projets en informatique décisionnelle\n- Data Scientists\n- Ingénieur de recherche et développement",
  "Formation: Master\nNom du programme: Modélisation des Sciences de Données en Ingénierie Mathématique\nID: MODASIM\n\nConditions d'admission:\n- Licence en Mathématiques ou un diplôme équivalent",
  "Les modules du semestre S1 de la formation Master (ID: MODASIM) sont: Analyse fonctionnelle appliquée (56h), Théories des distributions (56h), Problèmes variationnels des EDP elliptiques (56h), Programmation avancée: Python (56h), Statistiques en grandes dimensions (56h), Langues 1 (56h)",
  "Les modules du semestre S2 de la formation Master (ID: MODASIM) sont: Approximation numérique: Différences finis, Eléments finis et Volumes finis (56h), Analyse de Fourier, traitement de signal et image (56h), Optimisation déterministe et stochastique (56h), Machine Learning et Introduction au Deep Learning (56h), Soft Skills (56h), Langues 2 (56h)",
  "Les modules du semestre S3 de la formation Master (ID: MODASIM) sont: Algèbre linéaire et multilinéaire pour les grandes dimensions (56h), Equations aux dérivées partielles et application en sciences de données (56h), Représentations parcimonieuses (56h), Deep learning: aspect mathématiques et pratique (56h), Equations différentielles, Equations aux dérivées partielles stochastiques et applications (56h), Langues 3 (56h)",
  "Les modules du semestre S4 de la formation Master (ID: MODASIM) sont: STAGE // SOFT EMPLOYEMENT (336h)",
  "Contact de la formation Master de Modélisation des Sciences de Données en Ingénierie Mathématique (MODASIM): Département: Mathématiques, Responsable: M. HAKIM Abdelilah, Email: a. hakim@uca. ma",
  "Formation: Master\nNom du programme: Recherche et Développement en Physico-Chimie de l’Etat solide\nID: RDP-PCS\n\nObjectifs du programme:\n- Former des cadres scientifiques experts dans le secteur de la recherche et développement\n- Posséder une vision globale du cycle de vie des matériaux organiques et inorganiques\n- Développer des matériaux et de dispositifs de conversion et de stockage d’énergie",
  "Formation: Master\nNom du programme: Recherche et Développement en Physico-Chimie de l’Etat solide\nID: RDP-PCS\n\nCompétences visées:\n- Élaboration, conception, modélisation, fonctionnalisation et valorisation de tous types de matériaux\n- Caractérisations de matériaux\n- Conception et étude des matériaux de demain",
  "Formation: Master\nNom du programme: Recherche et Développement en Physico-Chimie de l’Etat solide\nID: RDP-PCS\n\nOpportunités professionnelles:\n- Insertion dans la vie active\n- Exercer son savoir-faire dans les différentes industries de matériaux\n- Accès à plusieurs CED Sciences et/ou Techniques à travers le Royaume ou à l’étranger",
  "Formation: Master\nNom du programme: Recherche et Développement en Physico-Chimie de l’Etat solide\nID: RDP-PCS\n\nConditions d'admission:\n- Licence en Chimie et/ou Physique de solide\n- Licence en chimie minérale ou la matière condensée\n- Licence en chimie physique\n- Licence en Sciences de la Matière Chimie\n- Licence en Chimie industrielle et/ou Génie des procédés\n- Licence en Techniques d'analyses et contrôle de qualité\n- Licence Sciences et Techniques Sciences de l’Ingénieur",
  "Les modules du semestre S1 de la formation MASTER (ID: RDP-PCS) sont: Thermodynamique de l’état solide et catalyse hétérogène (56h), Corrosion et protection des matériaux (56h), Techniques d'Analyses Chimiques des matériaux (56h), Génie des Procédés (56h), Microscopies et caractérisations thermiques et mécaniques des matériaux (56h), Langues étrangères et Cultures 1 (56h), VH global du semestre 1 (336h)",
  "Les modules du semestre S2 de la formation MASTER (ID: RDP-PCS) sont: Synthèse des matériaux polymères (56h), Traitements et Analyses des surfaces et interfaces (56h), Verres -Céramiques et matériaux polymères (56h), Métrologie (56h), Soft Skills (56h), Langues étrangères et Culture 2 (56h), VH global du semestre 2 (336h)",
  "Les modules du semestre S3 de la formation MASTER (ID: RDP-PCS) sont: Stockage d’énergie (56h), Modélisation/choix des matériaux et plans d’expériences (56h), Matériaux électro et magnétocaloriques (56h), Extraction des minéraux et recyclages (56h), Métallurgie (56h), Langues étrangères et Culture 3 (56h)",
  "Les modules du semestre S4 de la formation MASTER (ID: RDP-PCS) sont: STAGE // SOFT EMPLOYEMENT (336h)",
  "Contact de la formation MASTER de Recherche et Développement en Physico-Chimie de l’Etat solide (RDP-PCS): Département: Sciences Chimiques, Responsable: M. AMJOUD Mbarek, Email: m. amjoud@uca. ma",
  "Connexion eCampus UCA: Le nom d’utilisateur est l’email académique (exemple: a. test1234@uca. ac. ma).",
  "Connexion eCampus UCA: Le mot de passe par défaut est le Code Massar ou CNE (exemple: G136111111).",
  "Procédure de connexion eCampus UCA: 1) Entrer l’email académique. 2) Entrer le Code Massar/CNE. 3) Cliquer sur Connexion.",
  "Connexion eCampus via Google: Il est possible de se connecter en cliquant sur « Votre compte @uca. ac. ma » pour utiliser l'authentification Google.",
  "Problème connexion eCampus: En cas de mot de passe oublié, cliquer sur « Mot de passe perdu? » pour le réinitialiser.",
  "Accès anonyme eCampus: Il est possible d'accéder à la plateforme sans compte en cliquant sur « Accéder en tant qu’anonyme », mais l'accès sera limité.",
  "Plateforme numérique UCA: La plateforme utilisée s’appelle « UCA Campus Numérique ».",
  "Langues eCampus: La page de connexion est disponible en Français, Arabe et parfois Anglais.",
  "Définition Bourse ONOUSC: L'ONOUSC accorde des bourses universitaires aux étudiants marocains pour soutenir leur parcours académique et alléger les charges financières des méritants.",
  "Condition Bourse ONOUSC (Nationalité): L'étudiant doit impérativement être de nationalité marocaine.",
  "Condition Bourse ONOUSC (Âge): L'étudiant doit avoir moins de 26 ans au moment de l'examen du baccalauréat (session normale).",
  "Condition Bourse ONOUSC (Académique): L'étudiant doit avoir obtenu le baccalauréat de l'année en cours.",
  "Condition Bourse ONOUSC (Administratif): L'étudiant doit être inscrit au Registre National de la Population (RNP) et au Registre Social Unifié (RSU).",
  "Critère d'octroi Bourse ONOUSC: L'étudiant doit atteindre le seuil de mérite fixé par la commission nationale des bourses (basé sur le RSU).",
  "Établissements éligibles Bourse ONOUSC: L'étudiant doit être inscrit dans un établissement d’enseignement supérieur public ou un centre de formation professionnelle.",
  "Procédure demande Bourse ONOUSC: Les demandes se font exclusivement en ligne sur la plateforme www. minhaty. ma (via RNP ou CIN).",
  "Montants Bourse ONOUSC Cycle Licence: Pour une bourse complète (>20 km du domicile parental), les 1ère et 2ème tranches sont de 1900. 2 MAD, la 3ème de 2533. 6 MAD. Pour une demi-bourse (<20 km), les 1ère et 2ème tranches sont de 950. 1 MAD, la 3ème de 1266. 8 MAD.",
  "Montants Bourse ONOUSC Cycle Master: 1ère et 2ème tranches de 2200 MAD chacune, 3ème tranche de 2933 MAD. Réservée aux étudiants non fonctionnaires ayant eu une bourse en licence.",
  "Montants Bourse ONOUSC Cycle Doctorat: 1ère et 2ème tranches de 3664 MAD chacune, 3ème tranche de 4861 MAD. Attribuée sur critères d'excellence aux non fonctionnaires.",
  "Procédure Réclamation Bourse ONOUSC: Les réclamations se font via le site e-bourse-maroc. onousc. ma ou en suivant la procédure spécifique du service des bourses de l'établissement.",
  "Types de réclamations Bourse ONOUSC: Transfert, blocage CNSS, Double Bac, Étudiants à besoins spécifiques, OFPPT, Correction de résultats, Récupération de bourse, Non inscription, Données incorrectes.",
  "Problème Bourse et Transfert d'établissement: L'étudiant doit impérativement déposer une demande de transfert de bourse auprès du nouvel établissement d’accueil pour éviter le blocage des versements.",
  "Problème Bourse bloquée (CNSS): L'étudiant doit fournir les documents justificatifs requis au service des bourses de son établissement pour débloquer la situation.",
  "Réclamation Bourse ONOUSC (Double Bac): L'étudiant doit effectuer une demande de régularisation spécifique si l'existence d'un second baccalauréat bloque le versement de la bourse.",
  "Réclamation Bourse ONOUSC (Besoins spécifiques): Pour régulariser leur situation, les étudiants doivent fournir une attestation officielle délivrée par le Ministère de la Solidarité, du Développement Social, de l'Égalité et de la Famille.",
  "Réclamation Bourse ONOUSC (OFPPT): Les étudiants de l'OFPPT doivent transmettre les documents requis, notamment la lettre générée par le système de gestion des bourses, selon les directives de l’OFPPT.",
  "Réclamation Bourse ONOUSC (Erreur résultats): En cas d'erreur sur les résultats académiques bloquant la bourse, l'étudiant doit déposer une réclamation auprès de son établissement pour correction.",
  "Récupération Bourse ONOUSC (Interrompue/Non versée): L'étudiant doit fournir un historique complet des études et les justificatifs nécessaires (attestations d’inscription, certificats médicaux) pour rétablir les droits.",
  "Réclamation Bourse ONOUSC (Non inscription): Si la bourse est bloquée car l'étudiant apparaît comme non inscrit, il doit déposer une réclamation immédiate au service des bourses de son établissement.",
  "Réclamation Bourse ONOUSC (Données incorrectes): En cas de rejet pour données erronées, l'étudiant doit se rendre au service des bourses pour rectifier ses informations (nom, CNE, date de naissance, année du bac).",
  "Point focal Réclamations Bourse: Toutes les réclamations doivent être adressées au point focal chargé des bourses au sein de l’établissement, en respectant scrupuleusement les délais.",
  "Pièces à fournir Inscription Master 1ère année FST Gueliz (Dossier général): Récépissé de pré-inscription (https: //preins-fst. uca. ma/), Original et copie du Baccalauréat, Attestation réussite DEUST (ou équivalent), Original et copie de la Licence, Copie CIN, Photo d’identité, Enveloppes (timbrée et format A4), Déclaration sur l’honneur.",
  "Documents complémentaires Inscription Master FST Gueliz (Étrangers et Salariés): Pour les étudiants étrangers (Autorisation ministérielle de transfert, copie carte de séjour, copie passeport). Pour les salariés (Attestation de travail).",
  "Dépôt dossier inscription Master FST Gueliz: Le dépôt du dossier physique peut être effectué par l’étudiant lui-même ou par un proche.",
  "Retrait dossier inscription Master FST Gueliz: Le retrait du dossier ne peut être effectué que par l’étudiant en personne (présence obligatoire).",
  "Plateforme pré-inscription Master FST Gueliz: La pré-inscription en ligne s'effectue obligatoirement sur le site https: //preins-fst. uca. ma/.",
  "Pièces à fournir Inscription Cycle Ingénieur 1ère année FST Gueliz (Dossier général): Récépissé pré-inscription (https: //preins-fst. uca. ma/), Original et copie du baccalauréat, Diplôme original du DEUST/Licence ou Attestation d'admission CNC, Copies des diplômes, Copie CIN, 2 photos d’identité, Enveloppes (timbrée et A4).",
  "Documents complémentaires Inscription Cycle Ingénieur FST Gueliz (Cas spécifiques): Pour les étudiants boursiers (Demande de transfert d’inscription délivrée par l’établissement initial). Pour les étudiants étrangers (Autorisation ministérielle, copie carte de séjour, copie passeport).",
  "Dépôt dossier inscription Cycle Ingénieur FST Gueliz: Le dépôt peut être effectué par l’étudiant lui-même ou par un proche.",
  "Retrait dossier inscription Cycle Ingénieur FST Gueliz: Le retrait du dossier ne peut être effectué que par l’étudiant en personne (présence obligatoire).",
  "Plateforme pré-inscription Cycle Ingénieur FST Gueliz: La procédure se fait obligatoirement via le site https: //preins-fst. uca. ma/.",
  "Pièces à fournir Inscription Post-Bac (Nouveaux bacheliers): Original et copie du Baccalauréat, Reçu UCANET imprimé (http: //preinscription. uca. ma/), Copie CIN, 2 photos d’identité, Enveloppe timbrée, Enveloppe A4 (avec Nom, Prénom, Code Massar, CIN, GSM et Filière).",
  "Document supplémentaire Inscription Post-Bac (Étudiants étrangers): Autorisation ministérielle d’inscription obligatoire.",
  "Retrait dossier inscription Post-Bac: Le retrait doit être effectué impérativement par le bachelier en personne ou par un tiers muni d'une procuration légalisée.",
  "Plateforme pré-inscription Post-Bac: La procédure se fait en ligne via le portail UCANET à l'adresse http: //preinscription. uca. ma/.",
  "Lien demande Carte étudiant FSTG Marrakech: La demande s'effectue via le lien https: //www. fstg-marrakech. ac. ma/FST/carte/.",
  "Informations requises Carte étudiant FSTG: Le formulaire nécessite le nom, prénom, Code Massar, CIN, date de naissance et la filière.",
  "Documents requis Carte étudiant FSTG: Il faut fournir une copie de la CIN, une photo d'identité, le reçu UCANET (pour les nouveaux bacheliers) et tout autre document spécifique demandé.",
  "Procédure soumission Carte étudiant FSTG: Après remplissage en ligne et upload des pièces, la demande est envoyée numériquement ou imprimée pour dépôt au bureau de la scolarité.",
  "Retrait Carte étudiant FSTG: La présence physique au bureau de la scolarité est nécessaire pour présenter les documents originaux ou récupérer la carte finale.",
  "Carte étudiant FSTG et Bourse ONOUSC: Les boursiers doivent vérifier la concordance des informations (Massar, CIN, filière) et suivre la procédure Carte Minhaty si nécessaire.",
  "Règle de retrait Carte étudiant FSTG: Si la demande en ligne peut être faite par un tiers, le retrait de la carte doit impérativement être effectué par l'étudiant lui-même.",
  "Historique FSTG: La Faculté des Sciences et Techniques de Gueliz (FSTG) est un établissement créé en 1991.",
  "Départements FSTG: La faculté compte 8 départements d'enseignement et de recherche.",
  "Corps enseignant FSTG: Il y a 198 Enseignants Chercheurs au sein de l'établissement.",
  "Personnel Administratif FSTG: L'effectif administratif est composé de 74 personnes.",
  "Effectif Étudiants FSTG: En 2020-2021, la faculté comptait 3454 étudiants inscrits.",
  "Étudiants Étrangers FSTG: La population étudiante étrangère représente 3% de l'effectif total.",
  "Offre de Formation FSTG: La faculté propose 25 filières au total, dont 8 Licences (LST), 9 Masters (MST) et 6 filières du Cycle Ingénieur.",
  "Structure de Recherche FSTG: La recherche est organisée autour de 9 laboratoires et 2 équipes de recherche.",
  "Centres de la FSTG: L'établissement abrite 3 centres: le Centre des études Doctorales, le Centre National d'Etudes et de Recherche sur l'Eau et l'Energie (CNEREE), et le Career Center.",
  "Doctorants FSTG: La faculté encadre 186 doctorants.",
  "Diplômés FSTG: Lors de l'année universitaire 2019-2020, la faculté a formé 589 diplômés.",
  "Capacité d'accueil FSTG: La faculté dispose d'une capacité physique de 4362 places.",
  "Chef Département Mathématiques FSTG: Le responsable est Pr. Said Raghay. Contact: (212) 6 70 09 95 31, Email: s. raghay@uca. ma.",
  "Chef Département Physique Appliquée FSTG: Le responsable est Pr. Abdellatif Bourial. Contact: (212) 6 70 09 95 35, Email: a. bourial@uca. ma.",
  "Chef Département Sciences Chimiques FSTG: Le responsable est Pr. Khalid Khatib. Contact: (212) 6 70 09 95 61, Email: k. khatib@uca. ma.",
  "Chef Département Biologie FSTG: Le responsable est Pr. Mimoun El Kaoua. Contact: (212) 6 70 09 95 45, Email: m. eikaoua@uca. ma.",
  "Chef Département Sciences de la Terre FSTG: Le responsable est Pr. Brahim Igmoullan. Contact: (212) 6 70 09 95 32, Email: bigmoulan@uca. ma.",
  "Chef Département Génie Civil FSTG: Le responsable est Pr. Azzouz Kchikach. Contact: (212) 6 70 09 88 84, Email: a. kchikach@uca. ma.",
  "Chef Département Informatique FSTG: Le responsable est Pr. Soulainane Kaloun. Contact Email: so. kaloun@uca. ma.",
  "Chef Département Techniques de Communication et Management FSTG: Le responsable est Pr. Abdelghani Belakouiri. Contact: (212) 6 70 09 95 17, Email: a. belakouiri@uca. ma.",
  "Histoire FSTG (Synthèse): Créée en 1991 (ex-Faculté des Sciences II), devenue FST en 1994 (accès régulé, système modulaire). Elle a adopté la réforme LMD en 2006 et participé aux initiatives '10000 Ingénieurs' et '25000 Licenciés'.",
  "Date de création FSTG: La faculté a été fondée en 1991 dans les anciens locaux du Centre Pédagogique Régional (construits en 1974) à Marrakech.",
  "Transformation FSTG: Le passage au statut de Faculté des Sciences et Techniques a eu lieu en 1994 pour renforcer l'enseignement supérieur technologique au Maroc.",
  "Système Pédagogique FSTG: L'établissement applique un système modulaire semestriel avec évaluation continue (depuis 1994) et suit l'architecture LMD (depuis 2006-2007).",
  "Implication Gouvernementale FSTG: La faculté a contribué aux programmes nationaux '10000 Ingénieurs' (2007-2010), 'Offshoring' et 'Qualification de 25000 Licenciés' (2015-2016).",
  "Missions FSTG: Former selon les besoins de la région Marrakech-Safi, soutenir le développement économique (recherche/formation continue), adapter les compétences au marché de l'emploi et promouvoir la culture d'entreprise (stages).",
  "Réseau FST Maroc: La FSTG fait partie d'un réseau national de 8 établissements (incluant Béni Mellal, Errachidia, Fès, Mohammédia, Settat, Tanger et Al Hoceima).",
  "Approche Formation FSTG: L'offre combine des formations de base scientifiques/techniques et des formations spécialisées orientées vers l'emploi et la recherche.",
  "Master FSTG (Département Biologie): Le Master Sciences et Techniques (MST) proposé est « Biotechnologie Végétale pour l'amélioration des plantes ».",
  "Liste des filières Licence Sciences et Techniques (LST) à la FSTG: Bio-Analyses, Biotechnologie des plantes, Géologie appliquée aux ressources minières, Eau et Environnement (Exploration et exploitation des ressources en eau), Systèmes d'informations Répartis, Mathématiques et Informatique appliquées aux Sciences de l'Ingénieur, Informatique Électronique Électrotechnique & Automatique, et Physico-Chimie des Matériaux.",
  "Localisation Bibliothèque FSTG Marrakech: Elle se situe au sein du campus de la Faculté des Sciences et Techniques Guéliz. Elle est accessible aux étudiants, enseignants et chercheurs.",
  "Horaires Bibliothèque FSTG: Les horaires habituels sont du lundi au vendredi de 8h00 à 18h00 (il est recommandé de vérifier sur le site officiel).",
  "Consultation documents Bibliothèque FSTG: L'accès aux livres se fait sur place. La consultation est gratuite et certains documents sont empruntables.",
  "Politique d'emprunt Bibliothèque FSTG: Oui, les étudiants inscrits peuvent emprunter des livres en respectant les règles de prêt et les délais en vigueur.",
  "Recherche documentaire Bibliothèque FSTG: Pour trouver un livre, utilisez le catalogue en ligne ou demandez l'aide du personnel sur place.",
  "Ressources numériques Bibliothèque FSTG: La bibliothèque offre l'accès à des e-books, revues scientifiques et bases de données via l'intranet ou eCampusFST.",
  "Réservation livre Bibliothèque FSTG: Si un livre est indisponible, il est possible de faire une demande de réservation ou de solliciter le personnel pour une solution alternative.",
  "Carte lecteur Bibliothèque FSTG: Elle est délivrée lors de l’inscription ou sur demande au service de la bibliothèque. Elle est obligatoire pour emprunter.",
  "Adresse FSTG Marrakech: La faculté est située Avenue Abdelkrim El Khattabi, B. P. 549, Guéliz, 40000 Marrakech, Maroc.",
  "Moyens d'accès FSTG Marrakech: L'établissement est accessible en transport public, taxi ou voiture privée (localisation disponible sur Google Maps).",
  "Examens en ligne FSTG: Certains examens peuvent se dérouler sur eCampusFST selon l'enseignant, mais les finaux sont généralement en présentiel.",
  "Résultats Examens FSTG: Les notes sont consultables sur eCampusFST ou le portail de la scolarité après validation.",
  "Révisions et Annales FSTG: Des annales et exercices types sont disponibles à la bibliothèque et sur eCampusFST pour la préparation.",
  "Absence Examen FSTG: En cas d'absence, il faut contacter le service de la scolarité pour connaître la procédure de rattrapage (selon règlement).",
  "Horaires Administration FSTG: Les bureaux sont généralement ouverts du lundi au vendredi de 8h00 à 18h00 (vérifier sur le site officiel).",
  "Horaires Cours FSTG: Les enseignements se déroulent généralement entre 8h00 et 17h00 selon l’emploi du temps semestriel.",
  "Délais Inscriptions FSTG (2025-2026): Les préinscriptions sont ouvertes jusqu’au 29 août 2025 (Attention: date limite différente pour Sciences Semlalia, le 25 août).",
  "Calendrier Examens FSTG: Les dates sont publiées chaque semestre sur le site officiel ou eCampusFST.",
  "Horaires Spéciaux FSTG (Boursiers/Étrangers): Les horaires de cours sont identiques, mais des plages spécifiques peuvent être fixées pour le dépôt de dossiers administratifs.",
  "Horaires Ramadan FSTG: Les cours sont généralement aménagés en deux plages: matin (8h00-12h00) et après-midi (12h30-16h00).",
  "Page Facebook officielle Université Cadi Ayyad (UCA): Accessible à l'adresse https: //www. facebook. com/uca. ma/ (plus de 51 000 abonnés).",
  "Utilité Page Facebook UCA: Elle permet de suivre les actualités, annonces importantes, événements, préinscriptions, résultats et informations pratiques.",
  "Contact via Facebook UCA: Il est possible d'envoyer des messages, mais pour les démarches officielles (inscriptions, bourses), il faut contacter les services administratifs.",
  "Compte Instagram officiel Université Cadi Ayyad (UCA): Accessible à l'adresse https: //www. instagram. com/universite_cadi_ayyad/.",
  "Utilité Instagram UCA: Ce compte diffuse les événements, campagnes de préinscription, activités culturelles/scientifiques et informations étudiantes.",
  "Contact via Instagram UCA: Les messages directs sont possibles, mais les demandes officielles (examens, bourses) doivent être adressées aux services administratifs."
]